{
    "error_frame": {
        "not_inserted": "No gamecard inserted.",
        "processing": "Processing gamecard, please wait…",
        "nogc_enabled": "A gamecard has been inserted, but the \"nogc\" patch is enabled.\nNothing at all can be done with the inserted gamecard.\nDisabling this patch *will* update the Lotus ASIC firmware if it's outdated.\nConsider disabling this patch if you wish to use gamecard dumping features.",
        "lafw_update_required": "A gamecard has been inserted, but a Lotus ASIC firmware update is required.\nUpdate your console using the inserted gamecard and try again.",
        "info_not_loaded": "A gamecard has been inserted, but an unexpected I/O error occurred.\nPlease report this issue at \"{0}\"."
    },

    "list": {
        "launch_error_info": "Please take out the gamecard and reinsert it into the console after exiting nxdumptool to mitigate launch errors.",

        "user_titles": {
            "header": "Applications available in the inserted gamecard",
            "info": "To perform operations on the user titles available in this gamecard, please go to the \"{0}\" menu."
        },

        "properties_table": {
            "header": "Gamecard properties",
            "capacity": "Capacity",
            "total_size": "Total size",
            "trimmed_size": "Trimmed size",
            "update_version": "Bundled update version",
            "lafw_version": "Required LAFW version",
            "sdk_version": "SDK version",
            "compatibility_type": "Compatibility type",
            "package_id": "Package ID",
            "card_id_set": "Card ID Set"
        },

        "dump_options": "Dump options",

        "dump_card_image": {
            "label": "Dump gamecard image (XCI)",
            "description": "Generates a raw gamecard image. This is the option most people will want to use."
        },

        "advanced_disclaimer": "The following options are considered advanced and are mostly aimed at developers, preservationists and experienced users.",

        "dump_initial_data": {
            "label": "Dump InitialData area",
            "description": "The InitialData area holds cryptographic information used by the Lotus ASIC to communicate with the gamecard.\n\nIt can't be dumped through normal means — it's not part of the storage areas from gamecard images."
        },

        "dump_certificate": {
            "label": "Dump gamecard certificate",
            "description": "The gamecard certificate serves to unequivocally identify each individual gamecard.\n\nIt's mostly used for online operations, and it's stored at page {0} in all gamecard images."
        },

        "dump_card_id_set": {
            "label": "Dump card ID set",
            "description": "The card ID set is composed of three 32-bit integers that hold information such as the gamecard's memory type and manufacturer.\n\nIt can't be dumped through normal means — it's not part of the storage areas from gamecard images."
        },

        "dump_card_uid": {
            "label": "Dump card UID",
            "description": "The card UID is a 64-byte long area that serves as a unique identifier for the gamecard. It's mostly used in security contexts.\n\nIt can't be dumped through normal means — it's not part of the storage areas from gamecard images."
        },

        "dump_header": {
            "label": "Dump gamecard header",
            "description": "The gamecard header holds information such as the location of the root HFS partition and the gamecard capacity.\n\nIt's stored at page {0} in all gamecard images."
        },

        "dump_plaintext_cardinfo": {
            "label": "Dump plaintext CardInfo area",
            "description": "The CardInfo area holds information such as the bundled system update version and the Lotus ASIC firmware version required by the gamecard.\n\nThis area is part of the gamecard header, but it's always encrypted."
        },

        "dump_specific_data": {
            "label": "Dump SpecificData area",
            "description": "The SpecificData area is internally generated by the FS sysmodule, which means it can't be dumped through normal means.\n\nIt holds security data used at runtime by the Lotus ASIC."
        },

        "dump_hfs_partitions": {
            "label": "Dump Hash File System (HFS) partitions",
            "description": "Dumps data from the HFS partitions located within the gamecard storage areas, in both raw and extracted forms."
        },

        "browse_hfs_partitions": {
            "label": "Browse Hash File System (HFS) partitions",
            "description": "Displays a filesystem browser with file dumping capabilities using a specific gamecard HFS partition."
        },

        "dump_lafw": {
            "label": "Dump Lotus ASIC firmware (LAFW) blob",
            "description": "Dumps the encrypted LAFW blob stored within the FS sysmodule program memory."
        }
    }
}
